tutorials/compressible/sonicDyMFoam/shockCube/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) //0
    (3 0 0)
    (0 1 0) //2
    (3 1 0)
    (0 0 1) //4
    (3 0 1)
    (0 1 1) //6
    (3 1 1)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (30 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 6 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 3 7 5)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type patch;
        inGroups (groupWalls);
        faces
        (
            (2 6 7 3)
        );
    }
    minZ
    {
        type symmetryPlane;
        faces
        (
            (0 2 3 1)
        );
    }
    maxZ
    {
        type patch;
        inGroups (groupWalls);
        faces
        (
            (4 5 7 6)
        );
    }
    obstacle
    {
        type patch;
        inGroups (groupWalls);
        faces
        (
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
